<template>
  <div class="mobile-header container">
    <section class="mobile-header-nav container">
      <router-link to="/" class="mobile-header__logo">
        <img src="@/assets/img/logo.svg" alt="">
      </router-link>

      <router-link tag="a" to="/*" class="mobile-header-nav__link">
          <svg class="mobile-header__ico" width="22" height="22" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M3 4.49996V2.69995C3.00001 2.17874 3.16765 1.66867 3.48266 1.23132C3.79768 0.793962 4.24662 0.448017 4.77529 0.235238C5.30395 0.0224602 5.88975 -0.0480548 6.46196 0.032205C7.03418 0.112465 7.56835 0.340069 8 0.687543C8.43165 0.340069 8.96582 0.112465 9.53804 0.032205C10.1103 -0.0480548 10.696 0.0224602 11.2247 0.235238C11.7534 0.448017 12.2023 0.793962 12.5173 1.23132C12.8324 1.66867 13 2.17874 13 2.69995V4.49996H14.5C14.8978 4.49996 15.2794 4.64219 15.5607 4.89536C15.842 5.14854 16 5.49192 16 5.84996V14.8545C16 15.6887 15.6318 16.4888 14.9763 17.0787C14.3209 17.6686 13.4319 18 12.505 18H4C2.93913 18 1.92172 17.6207 1.17157 16.9456C0.421427 16.2704 0 15.3548 0 14.4V5.84996C0 5.49192 0.158035 5.14854 0.43934 4.89536C0.720644 4.64219 1.10218 4.49996 1.5 4.49996H3ZM9.635 16.65C9.22706 16.1233 9.00887 15.4965 9.01 14.8545V5.84996H1.5V14.4C1.5 14.6955 1.56466 14.988 1.6903 15.261C1.81594 15.534 2.00009 15.7821 2.23223 15.991C2.46438 16.1999 2.73998 16.3657 3.04329 16.4787C3.34661 16.5918 3.6717 16.65 4 16.65H9.635ZM7.5 4.49996V2.69995C7.5 2.34191 7.34196 1.99853 7.06066 1.74535C6.77936 1.49218 6.39782 1.34994 6 1.34994C5.60218 1.34994 5.22064 1.49218 4.93934 1.74535C4.65804 1.99853 4.5 2.34191 4.5 2.69995V4.49996H7.5ZM9 4.49996H11.5V2.69995C11.5 2.42206 11.4048 2.15093 11.2272 1.92357C11.0497 1.69622 10.7985 1.52371 10.508 1.42959C10.2175 1.33548 9.90177 1.32435 9.60396 1.39772C9.30615 1.47109 9.04076 1.62539 8.844 1.83955C8.945 2.10955 9 2.39935 9 2.69995V4.49996ZM10.51 14.8545C10.51 15.3307 10.7202 15.7874 11.0943 16.1241C11.4685 16.4608 11.9759 16.65 12.505 16.65C13.0341 16.65 13.5415 16.4608 13.9157 16.1241C14.2898 15.7874 14.5 15.3307 14.5 14.8545V5.84996H10.51V14.8545Z" fill="#8D8D8D"/>
          </svg>
        </router-link>

        <router-link tag="a" to="/*" class="mobile-header-nav__link">
          <svg width="22" height="22" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17.325 4.10225V1.22C17.325 0.82175 17.0033 0.5 16.605 0.5H1.39501C0.996763 0.5 0.675013 0.82175 0.675013 1.22V4.10225C0.299264 4.12475 1.39408e-05 4.4375 1.39408e-05 4.82V7.78325C-0.00142697 8.32785 0.108845 8.86696 0.324014 9.36725C0.420764 9.59675 0.540013 9.81275 0.675013 10.0175V17.78C0.675013 18.176 0.996763 18.5 1.39501 18.5H16.605C17.0033 18.5 17.325 18.1783 17.325 17.78V10.0175C17.4621 9.81223 17.5796 9.59452 17.676 9.36725C17.8897 8.8655 18 8.33225 18 7.78325V4.82C18 4.4375 17.7008 4.12475 17.325 4.10225ZM2.29501 2.12H15.705V4.1H2.29501V2.12ZM10.44 16.8822H7.56001V14.54H10.44V16.8822ZM15.705 16.8822H11.88V13.82C11.88 13.4218 11.5583 13.1 11.16 13.1H6.84001C6.44176 13.1 6.12001 13.4218 6.12001 13.82V16.8822H2.29501V11.4328C2.36026 11.4643 2.42776 11.4958 2.49751 11.5228C2.99926 11.7343 3.53251 11.84 4.08151 11.84C4.63051 11.84 5.16151 11.7343 5.66551 11.5228C5.97601 11.3923 6.26851 11.2257 6.53626 11.0255C6.54076 11.0233 6.54526 11.0233 6.54976 11.0255C6.81834 11.2266 7.11082 11.3936 7.42051 11.5228C7.92226 11.7343 8.45551 11.84 9.00451 11.84C9.55351 11.84 10.0845 11.7343 10.5885 11.5228C10.899 11.3923 11.1915 11.2257 11.4593 11.0255C11.4638 11.0233 11.4683 11.0233 11.4728 11.0255C11.7413 11.2266 12.0338 11.3936 12.3435 11.5228C12.8453 11.7343 13.3785 11.84 13.9275 11.84C14.4765 11.84 15.0075 11.7343 15.5115 11.5228C15.579 11.4935 15.6465 11.4643 15.714 11.4328V16.8822H15.705ZM16.38 7.78325C16.38 9.12875 15.2775 10.22 13.9208 10.22C13.0028 10.22 12.2018 9.72275 11.7788 8.98475C11.7135 8.87225 11.5965 8.8025 11.466 8.8025H11.4525C11.3243 8.8025 11.205 8.87225 11.1398 8.98475C10.9239 9.36121 10.6122 9.67381 10.2364 9.89077C9.86054 10.1077 9.43396 10.2213 9.00001 10.22C8.08426 10.22 7.28551 9.725 6.86251 8.98925C6.79501 8.8745 6.67351 8.8025 6.54076 8.8025C6.40801 8.8025 6.28426 8.8745 6.21901 8.98925C6.00188 9.36427 5.6898 9.67548 5.31416 9.89154C4.93853 10.1076 4.5126 10.2209 4.07926 10.22C2.72251 10.22 1.62001 9.12875 1.62001 7.78325V5.73125C1.62001 5.7245 1.62451 5.72 1.63126 5.72H16.3688C16.3755 5.72 16.38 5.7245 16.38 5.73125V7.78325Z" fill="#8D8D8D"/>
          </svg>
        </router-link>

        <router-link tag="a" to="/*" class="mobile-header-nav__link">
          <svg width="22" height="22" viewBox="0 0 14 19" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M6.95076 17.7198C6.04931 16.3722 5.28636 15.2514 4.64015 14.3022C3.49365 12.618 2.7146 11.4736 2.18135 10.5592C1.77366 9.86011 1.5365 9.33832 1.39651 8.85084C1.25805 8.36867 1.20459 7.88504 1.20459 7.25C1.20459 3.91436 3.82088 1.25 7.00004 1.25C10.1792 1.25 12.7955 3.91436 12.7955 7.25C12.7955 7.88504 12.742 8.36867 12.6036 8.85084C12.4636 9.33832 12.2264 9.86011 11.8187 10.5592C11.2855 11.4736 10.5064 12.618 9.35994 14.3022C8.71381 15.2513 7.95099 16.3719 7.04969 17.7193C7.03874 17.7355 7.02946 17.7415 7.02407 17.7443C7.01735 17.7478 7.00915 17.75 7.00004 17.75C6.99093 17.75 6.98274 17.7478 6.97601 17.7443C6.97057 17.7415 6.96116 17.7353 6.95008 17.7188L6.32736 18.1368L6.95076 17.7198ZM7.00004 10.8125C8.94208 10.8125 10.4773 9.1956 10.4773 7.25C10.4773 5.3044 8.94208 3.6875 7.00004 3.6875C5.05801 3.6875 3.52277 5.3044 3.52277 7.25C3.52277 9.1956 5.05801 10.8125 7.00004 10.8125Z" stroke="#8D8D8D" stroke-width="1.5"/>
          </svg>
        </router-link>
    </section>
    <section class="mobile-header__main container">
      <div class="mobile-header__menu">
      <button class="mobile-header__btn" v-show="showList == false" @click="showList = !showList">
        <svg width="24" height="20" viewBox="0 0 24 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M0 2H24" stroke="#8D8D8D" stroke-width="2.16667"/>
          <path d="M0 10H24" stroke="#8D8D8D" stroke-width="2.16667"/>
          <path d="M0 18H24" stroke="#8D8D8D" stroke-width="2.16667"/>
        </svg>
      </button>
      <transition name="show-list">
        <div class="mobile-header__wrapper" v-if="showList">
          <ul class="mobile-header__list">
              <svg class="mobile-header__close" @click="showList = !showList" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M19 1L1 19" stroke="#8D8D8D" stroke-width="2"/>
                <path d="M1 1L19 19" stroke="#8D8D8D" stroke-width="2"/>
              </svg>
              <h3 class="mobile-header__title">Каталог</h3>
            <router-link
            v-for="link in links"
            :key="link.id + 1"
             class="mobile-header__link"
             tag="li"
             active-class="active"
             :to="link.url"
             exact
             >
             <img class="mobile-header__img" :src="require(`@/assets/img/menu/${link.img}.png`)" alt="">
              <span>
                {{ link.text }}
              </span>
              <div class="mobile-header__arrow">
                <svg class="mobile-header__arrow" width="8" height="16" viewBox="0 0 8 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                 <path d="M1.13526 15.4981C0.87047 15.4986 0.613858 15.4116 0.40997 15.2522C0.295217 15.1624 0.200361 15.0522 0.130833 14.9278C0.0613047 14.8035 0.0184714 14.6674 0.00478626 14.5273C-0.0088989 14.3873 0.00683311 14.2461 0.0510809 14.1118C0.0953286 13.9776 0.167222 13.8528 0.262645 13.7448L5.33967 8.01466L0.443968 2.27382C0.349833 2.16447 0.279534 2.03865 0.237114 1.90358C0.194694 1.76852 0.180989 1.62688 0.196785 1.4868C0.212582 1.34672 0.257569 1.21097 0.329162 1.08735C0.400755 0.963727 0.497541 0.854671 0.613958 0.766449C0.731212 0.669126 0.868525 0.595716 1.01728 0.550828C1.16604 0.505939 1.32302 0.490541 1.47838 0.505598C1.63375 0.520656 1.78413 0.565844 1.9201 0.638329C2.05608 0.710813 2.1747 0.809027 2.26853 0.926808L7.7422 7.34116C7.90888 7.53244 8 7.77239 8 8.02001C8 8.26763 7.90888 8.50757 7.7422 8.69886L2.07587 15.1132C1.96218 15.2426 1.81777 15.3448 1.65434 15.4117C1.49091 15.4786 1.31308 15.5082 1.13526 15.4981Z" fill="#8D8D8D"/>
                </svg>
              </div>
            </router-link>
          </ul>
        </div>
      </transition>
      </div>
      <form action="/catalog/" class="mobile-header-search">
      <button class="mobile-header-search__btn">
        <svg width="18" height="18" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M11.1188 22.2365C13.5858 22.236 15.9817 21.4102 17.9249 19.8905L24.0347 26L26 24.0349L19.8902 17.9254C21.4107 15.982 22.2371 13.5857 22.2377 11.1182C22.2377 4.98792 17.2495 0 11.1188 0C4.98819 0 0 4.98792 0 11.1182C0 17.2486 4.98819 22.2365 11.1188 22.2365ZM11.1188 2.77956C15.7179 2.77956 19.458 6.51946 19.458 11.1182C19.458 15.717 15.7179 19.4569 11.1188 19.4569C6.51981 19.4569 2.77971 15.717 2.77971 11.1182C2.77971 6.51946 6.51981 2.77956 11.1188 2.77956Z" fill="#E11C4B"/>
        </svg>
      </button>
      <input type="text" class="mobile-header-search__input" placeholder="Поиск среди товаров">
    </form>
    </section>

    <v-navigation/>
  </div>
</template>

<script>
import vNavigation from './v-navigation.vue'
export default {
  components: { vNavigation },
  data () {
    return {
      showList: false,
      links: [
        { id: '1', text: 'Ноутбуки и аксессуары', url: '/*', img: 'item1' },
        { id: '2', text: 'Смартфоны и аксессуары', url: '/*', img: 'item2' },
        { id: '3', text: 'Телевизоры и аксессуары', url: '/*', img: 'item3' },
        { id: '4', text: 'Фото и видеотехника', url: '/*', img: 'item4' },
        { id: '5', text: 'Планшеты и аксессуары', url: '/*', img: 'item5' },
        { id: '6', text: 'Наушники и аудиотехника', url: '/*', img: 'item6' },
        { id: '7', text: 'Гейминг', url: '/*', img: 'item7' },
        { id: '8', text: 'Умные часы', url: '/*', img: 'item8' },
        { id: '9', text: 'Портативная акустика', url: '/*', img: 'item9' },
        { id: '10', text: 'Сетевое оборудование', url: '/*', img: 'item10' },
        { id: '11', text: 'Офисная техника', url: '/*', img: 'item11' },
        { id: '12', text: 'Умный дом', url: '/*', img: 'item12' },
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
.mobile-header {
  width: 100%;
  margin: 0 auto;

  &__logo {
    margin-right: 32px;
    
    img {
      width: 159px;
    }
  }

  &__main {
    display: flex;
    align-items: center;
  }

  &-search {
      display: flex;
      align-items: center;
      height: 36px;
      width: 100%;
      max-width: 261px;
      border: 2px solid #DDDDDD;
      border-radius: 100px;
      padding: 18px 10px;

      &__btn {
        margin-right: 6px;
      }

      &__input {
        border: none;
        width: 100%;
        font-size: 14px;
      }
    }

  &__arrow {
    position: absolute;
    right: 0.5rem;
    top: 0.5rem;
  }

  &__title {
    margin: 48px 0 18px 10px;
    font-style: normal;
    font-weight: 700;
    font-size: 24px;
    line-height: 28px;
  }

  &__img {
    width: 35px;
    height: 35px;
    margin-right: 8px;
  }

  &__close {
    position: absolute;
    top: 18px;
    right: 15px;
    z-index: 3000;
    cursor: pointer;
  }
  &__wrapper {
    width: 100%;
    height: 100vh;
    background: rgb(255, 255, 255);
    position: absolute;
    top: 0;
    left: 0;
    z-index: 2;
    overflow: hidden;
  }

  &__menu {
    margin-right: 15px;
  }

  &__list {
    position: absolute;
    z-index: 70;
    top: 0;
    left: 0;
    height: 100%;
    background: rgb(255, 255, 255);
    width: 100%;
    overflow: hidden;
  }


  &-nav {
    margin: 20px 0 23px 0;
    display: flex;
    align-items: center;

    &__link {
    &:not(:last-child) {
      margin-right: 15px;
    }
  }
    
  }

  &__link {
    padding: 8px 0 8px 10px;
    display: flex;
    align-items: center;
    cursor: pointer;
    font-size: 16px;
    line-height: 19px;
    position: relative;

    span {
      width: 240px;
    }

    &:not(:last-child) {
    border-bottom: 2px solid #E8E8E8;
    }
  }
}
</style>